thumb2/nrf51sdk12_3/components/libraries/log/src/nrf_log_frontend.c
typedef struct {
    uint32_t type       : 2;
    uint32_t raw        : 1;
    uint32_t data       : 29;
} nrf_log_generic_header_t;

typedef struct {
    uint32_t type       : 2;
    uint32_t raw        : 1;
    uint32_t severity   : 3;
    uint32_t nargs      : 4;
    uint32_t addr       : 22;
} nrf_log_std_header_t;

typedef struct {
    uint32_t type       : 2;
    uint32_t raw        : 1;
    uint32_t severity   : 3;
    uint32_t offset     : 10;
    uint32_t reserved   : 6;
    uint32_t len        : 10;
} nrf_log_hexdump_header_t;

typedef struct {
    uint32_t type       : 2;
    uint32_t reserved0  : 4;
    uint32_t offset     : 10;
    uint32_t reserved1  : 6;
    uint32_t len        : 10;
} nrf_log_pushed_header_t;

typedef union {
    nrf_log_generic_header_t generic;
    nrf_log_std_header_t     std;
    nrf_log_hexdump_header_t hexdump;
    nrf_log_pushed_header_t  pushed;
    uint32_t                 raw;
} nrf_log_header_t;

/* IAR does not support initialization with non-constant variables */
#if defined ( __ICCARM__ )
#define STD_HEADER_DEF(NAME, P_STR, SEVERITY, NARGS)        \
    nrf_log_header_t NAME = {                               \
        .std = {                                            \
            .type     = HEADER_TYPE_STD,                    \
        }                                                   \
    };                                                      \
    NAME.std.type     = HEADER_TYPE_STD;                    \
    NAME.std.raw      = ((SEVERITY) & NRF_LOG_RAW);         \
    NAME.std.severity = (SEVERITY) & NRF_LOG_LEVEL_MASK;    \
    NAME.std.nargs    = (NARGS);                            \
    NAME.std.addr     = ((uint32_t)(P_STR) & STD_ADDR_MASK)
#else
#define STD_HEADER_DEF(NAME, P_STR, SEVERITY, NARGS)       \
    nrf_log_header_t NAME = {                              \
        .std = {                                           \
            .type     = HEADER_TYPE_STD,                   \
            .raw      = ((SEVERITY) & NRF_LOG_RAW),        \
            .severity = (SEVERITY) & NRF_LOG_LEVEL_MASK,   \
            .nargs    = (NARGS),                           \
            .addr     = ((uint32_t)(P_STR) & STD_ADDR_MASK)\
        }                                                  \
    }
#endif

#if defined ( __ICCARM__ )
#define HEXDUMP_HEADER_DEF(NAME, SEVERITY, LENGTH)          \
    nrf_log_header_t NAME = {                               \
        .hexdump = {                                        \
            .type     = HEADER_TYPE_HEXDUMP,                \
            .offset   = 0,                                  \
        }                                                   \
    };                                                      \
    NAME.hexdump.raw      = ((SEVERITY) & NRF_LOG_RAW);     \
    NAME.hexdump.severity = (SEVERITY) & NRF_LOG_LEVEL_MASK;\
    NAME.hexdump.len      = (LENGTH)

#else
#define HEXDUMP_HEADER_DEF(NAME, SEVERITY, LENGTH)          \
    nrf_log_header_t NAME = {                               \
        .hexdump = {                                        \
            .type     = HEADER_TYPE_HEXDUMP,                \
            .raw      = ((SEVERITY) & NRF_LOG_RAW),         \
            .severity = (SEVERITY) & NRF_LOG_LEVEL_MASK,    \
            .offset   = 0,                                  \
            .len      = LENGTH,                             \
        }                                                   \
    }
#endif

#if defined ( __ICCARM__ )
#define PUSHED_HEADER_DEF(NAME, OFFSET, LENGTH)        \
    nrf_log_header_t NAME = {                          \
        .pushed = {                                    \
            .type   = HEADER_TYPE_PUSHED,              \
        }                                              \
    };                                                 \
    NAME.pushed.offset = (OFFSET);                     \
    NAME.pushed.len   = (LENGTH)

#else
#define PUSHED_HEADER_DEF(NAME, OFFSET, LENGTH)        \
    nrf_log_header_t NAME = {                          \
        .pushed = {                                    \
            .type   = HEADER_TYPE_PUSHED,              \
            .offset = (OFFSET),                        \
            .len    = (LENGTH),                        \
        }                                              \
    }

#endif

ret_code_t nrf_log_init(nrf_log_timestamp_func_t timestamp_func)
{
    if (NRF_LOG_USES_TIMESTAMP && (timestamp_func == NULL)) {
        return NRF_ERROR_INVALID_PARAM;
    }

    ret_code_t err_code = nrf_log_backend_init(NRF_LOG_DEFERRED ? false : true);

    if (err_code == NRF_SUCCESS) {
        nrf_log_frontend_init(nrf_log_backend_std_handler_get(),
                              nrf_log_backend_hexdump_handler_get(),
                              timestamp_func);
    }
    return err_code;
}


ret_code_t nrf_log_blocking_backend_set(void)
{
    // Return value is ommited because
    return nrf_log_backend_init(true);
}


void nrf_log_frontend_init(nrf_log_std_handler_t     std_handler,
                           nrf_log_hexdump_handler_t hexdump_handler,
                           nrf_log_timestamp_func_t  timestamp_func)
{
#if NRF_LOG_DEFERRED
    m_log_data.mask   = NRF_LOG_DEFERRED_BUFSIZE - 1;
    m_log_data.wr_idx = 0;
    m_log_data.rd_idx = 0;
#endif //NRF_LOG_DEFERRED
#if NRF_LOG_USES_TIMESTAMP
    m_log_data.timestamp_func = timestamp_func;
#endif //NRF_LOG_USES_TIMESTAMP
    nrf_log_handlers_set(std_handler, hexdump_handler);
}


void nrf_log_handlers_set(nrf_log_std_handler_t     std_handler,
                          nrf_log_hexdump_handler_t hexdump_handler)
{
    m_log_data.std_handler     = std_handler;
    m_log_data.hexdump_handler = hexdump_handler;
}

#if (NRF_LOG_DEFERRED == 1)
/**
 * @brief Allocates chunk in a buffer for one entry and injects overflow if
 * there is no room for requested entry.
 *
 * @param nargs    Number of 32bit arguments. In case of allocating for hex dump it
 * is the size of the buffer in 32bit words (ceiled).
 * @param p_wr_idx Pointer to write index.
 *
 * @return True if successful allocation, false otherwise.
 *
 */
static inline bool buf_prealloc(uint32_t nargs, uint32_t * p_wr_idx)
{
    nargs += HEADER_SIZE;
    uint32_t ovflw_tag_size = HEADER_SIZE;
    bool     ret            = true;
    CRITICAL_REGION_ENTER();
    *p_wr_idx = m_log_data.wr_idx;
    uint32_t available_words = (m_log_data.mask + 1) - (m_log_data.wr_idx - m_log_data.rd_idx);
    uint32_t required_words  = nargs + ovflw_tag_size; // room for current entry and overflow
    if (required_words > available_words) {
        if (available_words >= HEADER_SIZE) {
            // Overflow entry is injected
            STD_HEADER_DEF(header, m_overflow_info, NRF_LOG_LEVEL_INTERNAL, 0);
            m_log_data.buffer[m_log_data.wr_idx++ & m_log_data.mask] =
                header.raw;
#if NRF_LOG_USES_TIMESTAMP
            m_log_data.buffer[m_log_data.wr_idx++ & m_log_data.mask] =
                m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        }
        // overflow case
        ret = false;
    } else {
        m_log_data.wr_idx += nargs;
    }
    CRITICAL_REGION_EXIT();
    return ret;
}


/**
 * @brief Function for preallocating a continuous chunk of memory from circular buffer.
 *
 * If buffer does not fit starting from current position it will be allocated at
 * the beginning of the circular buffer and offset will be returned indicating
 * how much memory has been ommited at the end of the buffer. Function is
 * using critical section.
 *
 * @param len32    Length of buffer to allocate. Given in words.
 * @param p_offset Offset of the buffer.
 * @param p_wr_idx Pointer to write index.
 *
 * @return A pointer to the allocated buffer. NULL if allocation failed.
 */
static inline uint32_t * cont_buf_prealloc(uint32_t len32,
        uint32_t * p_offset,
        uint32_t * p_wr_idx)
{
    uint32_t * p_buf = NULL;

    len32++; // Increment because 32bit header is needed to be stored.

    CRITICAL_REGION_ENTER();
    *p_wr_idx = m_log_data.wr_idx;
    uint32_t available_words = (m_log_data.mask + 1) -
                               (m_log_data.wr_idx & m_log_data.mask);
    if (len32 <= available_words) {
        // buffer will fit as is
        p_buf              = &m_log_data.buffer[(m_log_data.wr_idx + 1) & m_log_data.mask];
        m_log_data.wr_idx += len32;
        *p_offset          = 0;
    } else if (len32 < (m_log_data.rd_idx & m_log_data.mask)) {
        // wraping to the begining of the buffer
        m_log_data.wr_idx += (len32 + available_words - 1);
        *p_offset          = available_words - 1;
        p_buf              = m_log_data.buffer;
    }
    available_words = (m_log_data.mask + 1) - (m_log_data.wr_idx - m_log_data.rd_idx);
    // If there is no more room for even overflow tag indicate failed allocation.
    if (available_words < HEADER_SIZE) {
        p_buf = NULL;
    }
    CRITICAL_REGION_EXIT();

    return p_buf;
}
#endif //(NRF_LOG_DEFERRED == 1)


