thumb2/nrf51sdk12_3/components/libraries/log/src/nrf_log_frontend.c
#if (NRF_LOG_DEFERRED == 0)
static inline void nrf_log_direct_feed(uint8_t            type,
                                       char const * const p_str,
                                       uint32_t         * p_args,
                                       uint32_t           nargs)
{
    uint32_t   timestamp   = 0;
    uint32_t * p_timestamp = NRF_LOG_USES_TIMESTAMP ? &timestamp : NULL;

#if NRF_LOG_USES_TIMESTAMP
    timestamp = m_log_data.timestamp_func();
#else //NRF_LOG_USES_TIMESTAMP
    UNUSED_VARIABLE(timestamp);
#endif //NRF_LOG_USES_TIMESTAMP

    UNUSED_VARIABLE
    (m_log_data.std_handler(type, p_timestamp, (char *)p_str, p_args, nargs));

}
#endif //(NRF_LOG_DEFERRED == 0)


uint32_t nrf_log_push(char * const p_str)
{
#if (NRF_LOG_DEFERRED == 0)
    return (uint32_t)p_str;
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t mask      = m_log_data.mask;
    uint32_t slen      = strlen(p_str) + 1;
    uint32_t buflen    = CEIL_DIV(slen, 4);
    uint32_t offset    = 0;
    uint32_t wr_idx;
    char   * p_dst_str = (char *)cont_buf_prealloc(buflen, &offset, &wr_idx);
    if (p_dst_str) {
        PUSHED_HEADER_DEF(header, offset, buflen);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
        memcpy(p_dst_str, p_str, slen);
    }
    return (uint32_t)p_dst_str;
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_std_0(uint8_t severity, char const * const p_str)
{
#if (NRF_LOG_DEFERRED == 0)
    nrf_log_direct_feed(severity, p_str, NULL, 0);
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t nargs  = 0;
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    if (buf_prealloc(nargs, &wr_idx)) {
        // Proceed only if buffer was successfully preallocated.
        STD_HEADER_DEF(header, p_str, severity, nargs);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_std_1(uint8_t            severity,
                            char const * const p_str,
                            uint32_t           val0)
{
#if (NRF_LOG_DEFERRED == 0)
    uint32_t args[] = {val0};
    nrf_log_direct_feed(severity, p_str, args, ARRAY_SIZE(args));
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t nargs  = 1;
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    if (buf_prealloc(nargs, &wr_idx)) {
        // Proceed only if buffer was successfully preallocated.
        STD_HEADER_DEF(header, p_str, severity, nargs);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx & mask] = val0;
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_std_2(uint8_t            severity,
                            char const * const p_str,
                            uint32_t           val0,
                            uint32_t           val1)
{
#if (NRF_LOG_DEFERRED == 0)
    uint32_t args[] = {val0, val1};
    nrf_log_direct_feed(severity, p_str, args, ARRAY_SIZE(args));
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t nargs  = 2;
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    if (buf_prealloc(nargs, &wr_idx)) {
        // Proceed only if buffer was successfully preallocated.
        STD_HEADER_DEF(header, p_str, severity, nargs);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = val0;
        m_log_data.buffer[wr_idx & mask]   = val1;
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_std_3(uint8_t            severity,
                            char const * const p_str,
                            uint32_t           val0,
                            uint32_t           val1,
                            uint32_t           val2)
{
#if (NRF_LOG_DEFERRED == 0)
    uint32_t args[] = {val0, val1, val2};
    nrf_log_direct_feed(severity, p_str, args, ARRAY_SIZE(args));
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t nargs  = 3;
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    if (buf_prealloc(nargs, &wr_idx)) {
        // Proceed only if buffer was successfully preallocated.
        STD_HEADER_DEF(header, p_str, severity, nargs);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = val0;
        m_log_data.buffer[wr_idx++ & mask] = val1;
        m_log_data.buffer[wr_idx & mask]   = val2;
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_std_4(uint8_t            severity,
                            char const * const p_str,
                            uint32_t           val0,
                            uint32_t           val1,
                            uint32_t           val2,
                            uint32_t           val3)
{
#if (NRF_LOG_DEFERRED == 0)
    uint32_t args[] = {val0, val1, val2, val3};
    nrf_log_direct_feed(severity, p_str, args, ARRAY_SIZE(args));
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t nargs  = 4;
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    if (buf_prealloc(nargs, &wr_idx)) {
        // Proceed only if buffer was successfully preallocated.
        STD_HEADER_DEF(header, p_str, severity, nargs);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = val0;
        m_log_data.buffer[wr_idx++ & mask] = val1;
        m_log_data.buffer[wr_idx++ & mask] = val2;
        m_log_data.buffer[wr_idx & mask]   = val3;
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_std_5(uint8_t            severity,
                            char const * const p_str,
                            uint32_t           val0,
                            uint32_t           val1,
                            uint32_t           val2,
                            uint32_t           val3,
                            uint32_t           val4)
{
#if (NRF_LOG_DEFERRED == 0)
    uint32_t args[] = {val0, val1, val2, val3, val4};
    nrf_log_direct_feed(severity, p_str, args, ARRAY_SIZE(args));
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t nargs  = 5;
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    if (buf_prealloc(nargs, &wr_idx)) {
        // Proceed only if buffer was successfully preallocated.
        STD_HEADER_DEF(header, p_str, severity, nargs);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = val0;
        m_log_data.buffer[wr_idx++ & mask] = val1;
        m_log_data.buffer[wr_idx++ & mask] = val2;
        m_log_data.buffer[wr_idx++ & mask] = val3;
        m_log_data.buffer[wr_idx & mask]   = val4;
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_std_6(uint8_t            severity,
                            char const * const p_str,
                            uint32_t           val0,
                            uint32_t           val1,
                            uint32_t           val2,
                            uint32_t           val3,
                            uint32_t           val4,
                            uint32_t           val5)
{
#if (NRF_LOG_DEFERRED == 0)
    uint32_t args[] = {val0, val1, val2, val3, val4, val5};
    nrf_log_direct_feed(severity, p_str, args, ARRAY_SIZE(args));
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t nargs  = 6;
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    if (buf_prealloc(nargs, &wr_idx)) {
        // Proceed only if buffer was successfully preallocated.
        STD_HEADER_DEF(header, p_str, severity, nargs);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = val0;
        m_log_data.buffer[wr_idx++ & mask] = val1;
        m_log_data.buffer[wr_idx++ & mask] = val2;
        m_log_data.buffer[wr_idx++ & mask] = val3;
        m_log_data.buffer[wr_idx++ & mask] = val4;
        m_log_data.buffer[wr_idx & mask]   = val5;
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


void nrf_log_frontend_hexdump(uint8_t            severity,
                              char const * const p_str,
                              const void * const p_data,
                              uint16_t           length)
{
#if (NRF_LOG_DEFERRED == 0)
    uint32_t timestamp = 0;
#if NRF_LOG_USES_TIMESTAMP
    timestamp = m_log_data.timestamp_func();
#else //NRF_LOG_USES_TIMESTAMP
    (void) timestamp;
#endif //NRF_LOG_USES_TIMESTAMP

    uint32_t curr_offset = 0;

    do {
        curr_offset = m_log_data.hexdump_handler(severity,
                      NRF_LOG_USES_TIMESTAMP ? &timestamp : NULL,
                      p_str,
                      curr_offset,
                      p_data,
                      length,
                      NULL,
                      0);
    } while (curr_offset < length);
#else //(NRF_LOG_DEFERRED == 0)
    uint32_t mask   = m_log_data.mask;

